arendst/Tasmota/arduino/boards.txt
espino.menu.CpuFrequency.80=80 MHz
espino.menu.CpuFrequency.80.build.f_cpu=80000000L
espino.menu.CpuFrequency.160=160 MHz
espino.menu.CpuFrequency.160.build.f_cpu=160000000L

espino.menu.FlashMode.dio=DIO
espino.menu.FlashMode.dio.build.flash_mode=dio
espino.menu.FlashMode.qio=QIO
espino.menu.FlashMode.qio.build.flash_mode=qio

espino.menu.UploadSpeed.115200=115200
espino.menu.UploadSpeed.115200.upload.speed=115200
espino.menu.UploadSpeed.9600=9600
espino.menu.UploadSpeed.9600.upload.speed=9600
espino.menu.UploadSpeed.57600=57600
espino.menu.UploadSpeed.57600.upload.speed=57600
espino.menu.UploadSpeed.256000.windows=256000
espino.menu.UploadSpeed.256000.upload.speed=256000
espino.menu.UploadSpeed.230400.linux=230400
espino.menu.UploadSpeed.230400.macosx=230400
espino.menu.UploadSpeed.230400.upload.speed=230400
espino.menu.UploadSpeed.460800.linux=460800
espino.menu.UploadSpeed.460800.macosx=460800
espino.menu.UploadSpeed.460800.upload.speed=460800
espino.menu.UploadSpeed.512000.windows=512000
espino.menu.UploadSpeed.512000.upload.speed=512000
espino.menu.UploadSpeed.921600=921600
espino.menu.UploadSpeed.921600.upload.speed=921600

espino.menu.FlashSize.4M1M=4M (1M SPIFFS)
espino.menu.FlashSize.4M1M.build.flash_size=4M
espino.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espino.menu.FlashSize.4M1M.build.spiffs_start=0x300000
espino.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
espino.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
espino.menu.FlashSize.4M1M.build.spiffs_pagesize=256
espino.menu.FlashSize.4M1M.upload.maximum_size=1044464

espino.menu.FlashSize.4M3M=4M (3M SPIFFS)
espino.menu.FlashSize.4M3M.build.flash_size=4M
espino.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
espino.menu.FlashSize.4M3M.build.spiffs_start=0x100000
espino.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
espino.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
espino.menu.FlashSize.4M3M.upload.maximum_size=1044464

espino.menu.ResetMethod.ck=ck
espino.menu.ResetMethod.ck.upload.resetmethod=ck
espino.menu.ResetMethod.nodemcu=nodemcu
espino.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu

##############################################################
espinotee.name=ThaiEasyElec's ESPino

espinotee.upload.tool=esptool
espinotee.upload.speed=115200
espinotee.upload.resetmethod=nodemcu
espinotee.upload.maximum_size=1044464
espinotee.upload.maximum_data_size=81920
espinotee.upload.wait_for_upload_port=true
espinotee.serial.disableDTR=true
espinotee.serial.disableRTS=true

espinotee.build.mcu=esp8266
espinotee.build.f_cpu=80000000L
espinotee.build.board=ESP8266_ESP13
espinotee.build.core=esp8266
espinotee.build.variant=espinotee
espinotee.build.flash_mode=qio
espinotee.build.flash_size=4M
espinotee.build.flash_freq=40

espinotee.menu.CpuFrequency.80=80 MHz
espinotee.menu.CpuFrequency.80.build.f_cpu=80000000L
espinotee.menu.CpuFrequency.160=160 MHz
espinotee.menu.CpuFrequency.160.build.f_cpu=160000000L

espinotee.menu.UploadTool.esptool=Serial
espinotee.menu.UploadTool.esptool.upload.tool=esptool
espinotee.menu.UploadTool.esptool.upload.verbose=-vv
espinotee.menu.UploadTool.espota=OTA
espinotee.menu.UploadTool.espota.upload.tool=espota

espinotee.menu.UploadSpeed.115200=115200
espinotee.menu.UploadSpeed.115200.upload.speed=115200
espinotee.menu.UploadSpeed.9600=9600
espinotee.menu.UploadSpeed.9600.upload.speed=9600
espinotee.menu.UploadSpeed.57600=57600
espinotee.menu.UploadSpeed.57600.upload.speed=57600
espinotee.menu.UploadSpeed.256000.windows=256000
espinotee.menu.UploadSpeed.256000.upload.speed=256000
espinotee.menu.UploadSpeed.230400.linux=230400
espinotee.menu.UploadSpeed.230400.macosx=230400
espinotee.menu.UploadSpeed.230400.macosx=230400
espinotee.menu.UploadSpeed.230400.upload.speed=230400
espinotee.menu.UploadSpeed.460800.linux=460800
espinotee.menu.UploadSpeed.460800.macosx=460800
espinotee.menu.UploadSpeed.460800.upload.speed=460800
espinotee.menu.UploadSpeed.512000.windows=512000
espinotee.menu.UploadSpeed.512000.upload.speed=512000
espinotee.menu.UploadSpeed.921600=921600
espinotee.menu.UploadSpeed.921600.upload.speed=921600

espinotee.menu.FlashSize.4M3M=4M (3M SPIFFS)
espinotee.menu.FlashSize.4M3M.build.flash_size=4M
espinotee.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
espinotee.menu.FlashSize.4M3M.build.spiffs_start=0x100000
espinotee.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
espinotee.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
espinotee.menu.FlashSize.4M3M.build.spiffs_pagesize=256

espinotee.menu.FlashSize.4M1M=4M (1M SPIFFS)
espinotee.menu.FlashSize.4M1M.build.flash_size=4M
espinotee.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espinotee.menu.FlashSize.4M1M.build.spiffs_start=0x300000
espinotee.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
espinotee.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
espinotee.menu.FlashSize.4M1M.build.spiffs_pagesize=256

##############################################################
wifinfo.name=WifInfo

wifinfo.upload.tool=esptool
wifinfo.upload.speed=115200
wifinfo.upload.resetmethod=nodemcu
wifinfo.upload.maximum_size=434160
wifinfo.upload.maximum_data_size=81920
wifinfo.upload.wait_for_upload_port=true
wifinfo.serial.disableDTR=true
wifinfo.serial.disableRTS=true

wifinfo.build.mcu=esp8266
wifinfo.build.f_cpu=160000000L
wifinfo.build.core=esp8266
wifinfo.build.variant=wifinfo
wifinfo.build.flash_mode=qio
wifinfo.build.board=ESP8266_ESP12
wifinfo.build.spiffs_pagesize=256
wifinfo.build.debug_port=Serial1
wifinfo.build.debug_level=Wifinfo

wifinfo.menu.Debug.Disabled=Disabled
wifinfo.menu.Debug.Disabled.build.debug_port=
wifinfo.menu.Debug.Serial=Serial
wifinfo.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wifinfo.menu.Debug.Serial1=Serial1
wifinfo.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

wifinfo.menu.DebugLevel.None=None
wifinfo.menu.DebugLevel.None.build.debug_level=
wifinfo.menu.DebugLevel.Wifinfo=Wifinfo
wifinfo.menu.DebugLevel.Wifinfo.build.debug_level=-DDEBUG_ESP_WIFINFO

#wifinfo.menu.ESPModule.ESP07512=ESP07 (1M/512K SPIFFS)
#wifinfo.menu.ESPModule.ESP07512.build.board=ESP8266_ESP07
#wifinfo.menu.ESPModule.ESP07512.build.flash_size=1M
#wifinfo.menu.ESPModule.ESP07512.build.flash_ld=eagle.flash.1m512.ld
#wifinfo.menu.ESPModule.ESP07512.build.spiffs_start=0x7B000
#wifinfo.menu.ESPModule.ESP07512.build.spiffs_end=0xFB000
#wifinfo.menu.ESPModule.ESP07512.build.spiffs_blocksize=8192
#wifinfo.menu.ESPModule.ESP07512.upload.maximum_size=499696

#wifinfo.menu.ESPModule.ESP07256=ESP07 (1M/256K SPIFFS)
#wifinfo.menu.ESPModule.ESP07256.build.board=ESP8266_ESP07
#wifinfo.menu.ESPModule.ESP07256.build.flash_size=1M
#wifinfo.menu.ESPModule.ESP07256.build.flash_ld=eagle.flash.1m256.ld
#wifinfo.menu.ESPModule.ESP07256.build.spiffs_start=0xBB000
#wifinfo.menu.ESPModule.ESP07256.build.spiffs_end=0xFB000
##wifinfo.menu.ESPModule.ESP07256.build.spiffs_blocksize=4096
#wifinfo.menu.ESPModule.ESP07256.upload.maximum_size=761840

wifinfo.menu.ESPModule.ESP07192=ESP07 (1M/192K SPIFFS)
wifinfo.menu.ESPModule.ESP07192.build.board=ESP8266_ESP07
wifinfo.menu.ESPModule.ESP07192.build.flash_size=1M
wifinfo.menu.ESPModule.ESP07192.build.flash_ld=eagle.flash.1m192.ld
wifinfo.menu.ESPModule.ESP07192.build.spiffs_start=0xCB000
wifinfo.menu.ESPModule.ESP07192.build.spiffs_end=0xFB000
wifinfo.menu.ESPModule.ESP07192.build.spiffs_blocksize=4096
wifinfo.menu.ESPModule.ESP07192.upload.maximum_size=827376

#wifinfo.menu.ESPModule.ESP07160=ESP07 (1M/160K SPIFFS)
#wifinfo.menu.ESPModule.ESP07160.build.board=ESP8266_ESP07
#wifinfo.menu.ESPModule.ESP07160.build.flash_size=1M
#wifinfo.menu.ESPModule.ESP07160.build.flash_ld=eagle.flash.1m160.ld
#wifinfo.menu.ESPModule.ESP07160.build.spiffs_start=0xD3000
#wifinfo.menu.ESPModule.ESP07160.build.spiffs_end=0xFB000
#wifinfo.menu.ESPModule.ESP07160.build.spiffs_blocksize=4096
#wifinfo.menu.ESPModule.ESP07160.upload.maximum_size=860144
#
#wifinfo.menu.ESPModule.ESP07144=ESP07 (1M/144K SPIFFS)
#wifinfo.menu.ESPModule.ESP07144.build.board=ESP8266_ESP07
#wifinfo.menu.ESPModule.ESP07144.build.flash_size=1M
#wifinfo.menu.ESPModule.ESP07144.build.flash_ld=eagle.flash.1m144.ld
#wifinfo.menu.ESPModule.ESP07144.build.spiffs_start=0xD7000
#wifinfo.menu.ESPModule.ESP07144.build.spiffs_end=0xFB000
#wifinfo.menu.ESPModule.ESP07144.build.spiffs_blocksize=4096
#wifinfo.menu.ESPModule.ESP07144.upload.maximum_size=876528
#
#wifinfo.menu.ESPModule.ESP07=ESP07 (1M/64K SPIFFS)
#wifinfo.menu.ESPModule.ESP07.build.board=ESP8266_ESP07
#wifinfo.menu.ESPModule.ESP07.build.flash_size=1M
#wifinfo.menu.ESPModule.ESP07.build.flash_ld=eagle.flash.1m64.ld
#wifinfo.menu.ESPModule.ESP07.build.spiffs_start=0xEB000
#wifinfo.menu.ESPModule.ESP07.build.spiffs_end=0xFB000
#wifinfo.menu.ESPModule.ESP07.build.spiffs_blocksize=4096
#wifinfo.menu.ESPModule.ESP07.upload.maximum_size=958448

